
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/13090097175)


<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.ssh_prod-k8s-gw-01
  * cloudflare_zero_trust_access_application.ssh_prod-k8s-gw-01
  * cloudflare_zero_trust_access_policy.ssh_prod-k8s-gw-01
* Update
  * cloudflare_zero_trust_tunnel_cloudflared_config.cloudflared-01


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.ssh_prod-k8s-gw-01 will be created
  + resource "cloudflare_record" "ssh_prod-k8s-gw-01" {
      + allow_overwrite = false
      + comment         = "SSH to prod-k8s-gw-01"
      + content         = "00bab218-3cd8-4f5e-a9bb-a3aab8143173.cfargotunnel.com"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ssh-prod-k8s-gw-01"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "b52fd73ec52e35fea1807a173e33e93a"
    }

  # cloudflare_zero_trust_access_application.ssh_prod-k8s-gw-01 will be created
  + resource "cloudflare_zero_trust_access_application" "ssh_prod-k8s-gw-01" {
      + account_id                   = (known after apply)
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + domain                       = (known after apply)
      + domain_type                  = (known after apply)
      + enable_binding_cookie        = false
      + id                           = (known after apply)
      + name                         = (known after apply)
      + options_preflight_bypass     = false
      + service_auth_401_redirect    = false
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + skip_interstitial            = false
      + type                         = "self_hosted"
      + zone_id                      = "b52fd73ec52e35fea1807a173e33e93a"
    }

  # cloudflare_zero_trust_access_policy.ssh_prod-k8s-gw-01 will be created
  + resource "cloudflare_zero_trust_access_policy" "ssh_prod-k8s-gw-01" {
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = (known after apply)
      + precedence     = 1
      + zone_id        = "b52fd73ec52e35fea1807a173e33e93a"

      + include {
          + group = [
              + "416409ba-aaad-420a-b2ac-a3720ec3b79b",
            ]
        }
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.cloudflared-01 will be updated in-place
  ~ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "cloudflared-01" {
        id         = "00bab218-3cd8-4f5e-a9bb-a3aab8143173"
        # (2 unchanged attributes hidden)

      ~ config {
          ~ ingress_rule {
              + hostname = (known after apply)
              ~ service  = "http_status:404" -> "ssh://192.168.20.5:22"
                # (1 unchanged attribute hidden)
            }
          + ingress_rule {
              + service = "http_status:404"
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":60,"Program":"tfcmt","SHA1":"57dd58e8e141b293c0c4399b7f5012bad6faed9b","Vars":{},"WorkflowName":"Terraform CI"} -->